tests/dfd.dot
digraph tm {
	graph [
	fontname = Arial;
	fontsize = 14;
	]
	node [
	fontname = Arial;
	fontsize = 14;
	rankdir = lr;
	]
	edge [
	shape = none;
	fontname = Arial;
	fontsize = 12;
	]
	labelloc = "t";
	fontsize = 20;
	nodesep = 1;

subgraph cluster_boundary_Internet_acf3059e70 {
	graph [
		fontsize = 10;
		fontcolor = firebrick2;
		style = dashed;
		color = firebrick2;
		label = <<i>Internet</i>>;
	]

actor_User_579e9aae81 [
	shape = square;
	label = <<table border="0" cellborder="0" cellpadding="2"><tr><td><b>User</b></td></tr></table>>;
]

}

subgraph cluster_boundary_ServerDB_88f2d9c06f {
	graph [
		fontsize = 10;
		fontcolor = firebrick2;
		style = dashed;
		color = firebrick2;
		label = <<i>Server/DB</i>>;
	]

datastore_SQLDatabase_d2006ce1bb [
	shape = none;
	color = black;
	label = <<table sides="TB" cellborder="0" cellpadding="2"><tr><td><font color="black"><b>SQL Database</b></font></td></tr></table>>;
]

}

server_WebServer_f2eb7a3ff7 [
	shape = circle
	color = black
	label = <<table border="0" cellborder="0" cellpadding="2"><tr><td><b>Web Server</b></td></tr></table>>;
]
	actor_User_579e9aae81 -> server_WebServer_f2eb7a3ff7 [
		color = black;
		dir = forward;

		label = <<table border="0" cellborder="0" cellpadding="2"><tr><td><font color="black"><b>User enters<br/>comments (*)</b></font></td></tr></table>>;
	]
	server_WebServer_f2eb7a3ff7 -> datastore_SQLDatabase_d2006ce1bb [
		color = black;
		dir = forward;

		label = <<table border="0" cellborder="0" cellpadding="2"><tr><td><font color="black"><b>Insert query<br/>with comments</b></font></td></tr></table>>;
	]
	datastore_SQLDatabase_d2006ce1bb -> server_WebServer_f2eb7a3ff7 [
		color = black;
		dir = forward;

		label = <<table border="0" cellborder="0" cellpadding="2"><tr><td><font color="black"><b>Retrieve<br/>comments</b></font></td></tr></table>>;
	]
	server_WebServer_f2eb7a3ff7 -> actor_User_579e9aae81 [
		color = black;
		dir = forward;

		label = <<table border="0" cellborder="0" cellpadding="2"><tr><td><font color="black"><b>Show comments<br/>(*)</b></font></td></tr></table>>;
	]
}
